renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type2/aws_ota_pal.c
    /* Set default return status to uninitialized. */
    OTA_Err_t eResult = kOTA_Err_Uninitialized;

    if( NULL != C )
    {
        if( NULL != C->pucFile )
        {
            C->pucFile = NULL;
        }
    		eResult = kOTA_Err_None;
    }
    else /* Context was not valid. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid context.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_FileAbort;
    }

    return eResult;
}
/*-----------------------------------------------------------*/

/* Write a block of data to the specified file. */
int16_t prvPAL_WriteBlock( OTA_FileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pacData,
                           uint32_t ulBlockSize )
{
#if (MY_BSP_CFG_OTA_ENABLE == 1)

    DEFINE_OTA_METHOD_NAME( "prvPAL_WriteBlock" );

    static FILINFO filinfo;
    uint8_t     drvno = 0 ;
	int16_t lReturnVal = 0;

    int16_t  err = -1;

    err = file_write_process(pacData, (int16_t) ulBlockSize, ulOffset);
    if (err != 0)
    {
    	while(1);
    }

    if( (C->ulBlocksRemaining) == 1U)
	{
    	load_firmware_control_block.firmware_length = (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
        if(TFAT_FR_OK == R_tfat_f_stat(C->pucFilePath, &filinfo))
        {
        	R_FLASH_Open();

            /* Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
            firmware_update_status_initialize();

            /* 1st call, Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
            ota_firmware_update_request(C);

            /* 2nd call, Transition to FIRMWARE_UPDATE_STATE_ERASE state
               Execute update firmware write area initialization */
            ota_firmware_update_request(C);

        	while(FIRMWARE_UPDATE_STATE_COMPLETED != load_firmware_control_block.status)
         	{
         		load_firmware_process();
         	}

            return lReturnVal;
        }
        else
        {
            printf("File Not Found. %s.\r\n", C->pucFilePath);
            while(1);
        }

        return lReturnVal;
	}

    return lReturnVal;
#elif (MY_BSP_CFG_OTA_ENABLE == 2)

    DEFINE_OTA_METHOD_NAME( "prvPAL_WriteBlock" );

    int16_t  err = -1;

    // オンザフライ開始時にフラッシュ設定を初期化する
    if (0 == g_on_the_fly_start)
    {
        R_FLASH_Open();
        /* Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
        firmware_update_status_initialize();
        /* 1st call, Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
        ota_firmware_update_request(C);
        g_on_the_fly_start = 1; 
    }

    err = on_the_fly_write_process(pacData, (int16_t) ulBlockSize, ulOffset);
    if (err != 0)
    {
        printf("On-the-fly writting FAIL\r\n");
        return -1;
    }

    if( (C->ulBlocksRemaining) == 1U)
    {
        load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE;
        while(FIRMWARE_UPDATE_STATE_COMPLETED != load_firmware_control_block.status)
        {
            load_firmware_process();
        }
    }

    return 0;

#elif (MY_BSP_CFG_OTA_ENABLE == 3)

    DEFINE_OTA_METHOD_NAME( "prvPAL_WriteBlock" );
    int16_t  err = -1;

    err = serial_flash_write_process(pacData, (int16_t) ulBlockSize, ulOffset);
    if (err != 0)
    {
        printf("Serial Flash writting FAIL\r\n");
    	return -1;
    }

    if( (C->ulBlocksRemaining) == 1U)
	{
    	load_firmware_control_block.firmware_length = (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);

    	R_FLASH_Open();

        /* Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
        firmware_update_status_initialize();

        /* 1st call, Transition to FIRMWARE_UPDATE_STATE_INITIALIZE state */
        ota_firmware_update_request(C);

        /* 2nd call, Transition to FIRMWARE_UPDATE_STATE_ERASE state
           Execute update firmware write area initialization */
        ota_firmware_update_request(C);

    	while(FIRMWARE_UPDATE_STATE_COMPLETED != load_firmware_control_block.status)
     	{
     		load_firmware_process();
     	}
	}
    return 0;

#else

#endif
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_CloseFile( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CloseFile" );

    /* Note: Updated firmware signature verification not implemented */
    OTA_Err_t eResult = kOTA_Err_None;

    if( C == NULL )
    {
    	eResult = kOTA_Err_FileClose;
    }

    if( kOTA_Err_None == eResult )
    {
        if( C->pxSignature != NULL )
        {
            /* Verify the file signature, close the file and return the signature verification result. */
            /* Note: skip Verify the file signature. */
//            eResult = prvPAL_CheckFileSignature( C );
            eResult = kOTA_Err_None;
        }
        else
        {
            eResult = kOTA_Err_SignatureCheckFailed;
        }

#if (MY_BSP_CFG_OTA_ENABLE == 1)
        FRESULT ret = TFAT_FR_OK;
        ret = R_tfat_f_close(&file);
		if (TFAT_FR_OK != ret)
		{
            OTA_LOG_L1( "[%s] ERROR - Failed to close OTA update file.\r\n", OTA_METHOD_NAME );
            eResult = kOTA_Err_FileClose;
		}
#endif /* MY_BSP_CFG_OTA_ENABLE == 1 */

        if( eResult == kOTA_Err_None )
        {
//                OTA_LOG_L1( "[%s] %s signature verification passed.\r\n", OTA_METHOD_NAME, pcOTA_JSON_FileSignatureKey );
        }
        else
        {
            OTA_LOG_L1( "[%s] ERROR - Failed to pass %s signature verification: %d.\r\n", OTA_METHOD_NAME,
                        cOTA_JSON_FileSignatureKey, eResult );

    	    /* If we fail to verify the file signature that means the image is not valid. We need to set the image state to aborted. */
    		prvPAL_SetPlatformImageState( eOTA_ImageState_Aborted );
        }
    }

    return eResult;
}
/*-----------------------------------------------------------*/


static OTA_Err_t prvPAL_CheckFileSignature( OTA_FileContext_t * const C )
{
    /* Note: Updated firmware signature verification not implemented */
    DEFINE_OTA_METHOD_NAME( "prvPAL_CheckFileSignature" );

    /* Avoid compiler warnings about unused variables for a release including source code. */
    R_INTERNAL_NOT_USED(OTA_METHOD_NAME);
    R_INTERNAL_NOT_USED(C);

    /* FIX ME. */
    return kOTA_Err_SignatureCheckFailed;
}
/*-----------------------------------------------------------*/

static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_ReadAndAssumeCertificate" );

    /* Note: We use the aws_ota_codesigner_certificate.h instead of pucCertName */

    uint8_t * pucCertData;
    uint32_t ulCertSize;
    uint8_t * pucSignerCert = NULL;

