renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type2/aws_ota_pal.c
    /* Set INTB to ram address */
#if __RENESAS_VERSION__ >= 0x01010000
    set_intb((void *)&g_ram_vector_table[0] );
#else
    set_intb( (uint32_t)&g_ram_vector_table[0] );
#endif
    return flash_vect;
}

/******************************************************************************
 Function Name   : bank_swap()
 Description     :
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void bank_swap(void)
{
	uint32_t level;
	flash_err_t flash_err;
	if(FIRMWARE_UPDATE_STATE_CAN_SWAP_BANK < load_firmware_control_block.status)
	{
		level = R_BSP_CpuInterruptLevelRead();
		R_BSP_CpuInterruptLevelWrite(14);
		flash_copy_vector_table();
		flash_err = R_FLASH_Control(FLASH_CMD_BANK_TOGGLE, NULL);
		if(FLASH_SUCCESS == flash_err)
		{
			while(1);	/* wait software reset in RAM */
		}
		while(1); /* death loop */
	}
}

void load_firmware_status(uint32_t *now_status, uint32_t *finish_status)
{
	*now_status    = load_firmware_control_block.status;
	*finish_status = FIRMWARE_UPDATE_STATE_COMPLETED;
}

/***********************************************************************************************************************
* Function Name: firm_block_read
* Description  :
* Arguments    :
* Return Value :
***********************************************************************************************************************/
static int32_t firm_block_read(uint32_t *firmware, uint32_t offset)
{

    uint8_t buf[256] = {0};
    uint8_t arg1[256] = {0};
    uint8_t arg2[256] = {0};
    uint8_t arg3[256] = {0};
    uint32_t read_size = 0;
    static uint32_t upprogram[4 + 1] = {0};
    static uint32_t current_char_position = 0;
    static uint32_t current_file_position = 0;
    static uint32_t previous_file_position = 0;

    uint16_t file_size = 0;
    FRESULT ret = TFAT_FR_OK;

    uint8_t     drvno = 0 ;

    if (0 == offset)
    {
        current_char_position = 0;
        current_file_position = 0;
        previous_file_position = 0;
        memset(upprogram,0,sizeof(upprogram));
    }

    if (USB_APL_YES == g_isFileWrite)
    {
        R_USB_HmscGetSem();

    	current_char_position = 0;
    	memset(buf, 0, sizeof(buf));

    	ret = R_tfat_f_lseek(&file, previous_file_position);
    	if (TFAT_FR_OK == ret)
    	{
    		while(1)
    		{
    			ret = R_tfat_f_read(&file, &buf[current_char_position++], FREAD_SIZE, &file_size);
    			if (TFAT_FR_OK == ret)
    			{
    				if (0 == file_size)
    				{
    					break;
    				}
    				else
    				{
    					previous_file_position += file_size;

    					/* received 1 line */
    					if(strstr((char*)buf, "\r\n"))
    					{
    						sscanf((char*)buf, "%256s %256s %256s", (char*)arg1, (char*)arg2, (char*)arg3);

    						if (!strcmp((char *)arg1, "sha1"))
    						{
#if (FREAD_SIZE == 45U)
    							previous_file_position -= (CF_DATA_LINE_NUM - PARAM_DATA_LINE_NUM);
    				        	ret = R_tfat_f_lseek(&file, previous_file_position);
    							for(int i=PARAM_DATA_LINE_NUM; i < CF_DATA_LINE_NUM; i++)
    							{
    								arg2[i] = NULL;
    							}
#endif
    							base64_decode(arg2, (uint8_t *)load_firmware_control_block.hash_sha1, strlen((char *)arg2));
    						}
    						if (!strcmp((char *)arg1, "max_cnt"))
    						{
    							sscanf((char*) arg2, "%x", load_firmware_control_block.firmware_length);
    						}
    						if (!strcmp((char *)arg1, "upprogram"))
    						{
                        		base64_decode(arg3, (uint8_t *)upprogram, strlen((char *)arg3));
                        		memcpy(&firmware[current_file_position], upprogram, 16);
                            	current_file_position += 4;
                            	read_size += 16;
    						}
#if (FREAD_SIZE == 45U)
    						if (!strcmp((char *)arg1, "upconst"))
    						{
    							// DATA FLASH data
    							previous_file_position -= (CF_DATA_LINE_NUM - DF_DATA_LINE_NUM);
    				        	ret = R_tfat_f_lseek(&file, previous_file_position);
    						}
#endif
            				if((current_file_position * 4) == FLASH_BUCKET_SIZE)
    						{
    							current_file_position = 0;
    							break;
    						}
    						current_char_position = 0;
    						memset(buf, 0, sizeof(buf));
    					}
    				}
    			}
    			else
    			{
    				goto firm_block_read_error;
    				break;
    			}
    		}
    	}

   		R_USB_HmscRelSem();
    	if (TFAT_FR_OK != ret)
    	{
firm_block_read_error:
			g_isFileWrite = USB_APL_NO;
			return -1;
		}
    }

    return 0;
}

uint32_t load_firmware_process(void)
{
	flash_interrupt_config_t cb_func_info;
	uint32_t required_dataflash_block_num;
	uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];

	switch(load_firmware_control_block.status)
	{
		case FIRMWARE_UPDATE_STATE_INITIALIZE: /* initialize */
			load_firmware_control_block.progress = 0;
			load_firmware_control_block.offset = 0;
			memset(&firmware_update_control_block_image, 0, sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK));
			memcpy(&firmware_update_control_block_image, (void *)FLASH_DF_BLOCK_0, sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK));
			cb_func_info.pcallback = flash_load_firmware_callback_function;
		    cb_func_info.int_priority = 15;
		    R_FLASH_Control(FLASH_CMD_SET_BGO_CALLBACK, (void *)&cb_func_info);
			load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_WAIT_START;
			break;
		case FIRMWARE_UPDATE_STATE_WAIT_START: /* wait start */
			/* this state will be changed by other process request using load_firmware_control_block.status */
			break;
		case FIRMWARE_UPDATE_STATE_ERASE: /* erase bank0 (0xFFE00000-0xFFEBFFFF) */
			R_FLASH_Erase((flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS, FLASH_NUM_BLOCKS_CF - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM);
			load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE;
			break;
		case FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE:
			/* this state will be changed by callback routine */
			break;
		case FIRMWARE_UPDATE_STATE_READ_WAIT_COMPLETE:
#if (MY_BSP_CFG_OTA_ENABLE == 1)
			if(!firm_block_read(load_firmware_control_block.flash_buffer, load_firmware_control_block.offset))
#elif (MY_BSP_CFG_OTA_ENABLE == 3)
			if(!serial_flash_firm_block_read(load_firmware_control_block.flash_buffer, load_firmware_control_block.offset))
#endif
			{
				R_FLASH_Write((uint32_t)load_firmware_control_block.flash_buffer, (uint32_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + load_firmware_control_block.offset, sizeof(load_firmware_control_block.flash_buffer));
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE;
			}
			else
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
			}
			break;
		case FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE:
			/* this state will be changed by callback routine */
			break;
		case FIRMWARE_UPDATE_STATE_FINALIZE: /* finalize */
            R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, hash_sha1, FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);

