renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type2/aws_ota_pal.c
		    if(!memcmp(hash_sha1, load_firmware_control_block.hash_sha1, SHA1_HASH_LENGTH_BYTE_SIZE))
		    {
		    	/* confirm which hash(hash0/hash1 on dataflash) is same as current executed area hash */
			    R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS, hash_sha1, FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);

				if(!memcmp(hash_sha1, firmware_update_control_block_image.data.hash0_sha1, SHA1_HASH_LENGTH_BYTE_SIZE))
				{
					/* hash0_sha1 is for current executed area mac, should write to hash1_sha1 */
					memcpy(firmware_update_control_block_image.data.hash1_sha1, load_firmware_control_block.hash_sha1, sizeof(firmware_update_control_block_image.data.hash1_sha1));
				}
				else
				{
					/* program_mac1 is for current executed area mac, should write to hash0_sha1 */
					memcpy(firmware_update_control_block_image.data.hash0_sha1, load_firmware_control_block.hash_sha1, sizeof(firmware_update_control_block_image.data.hash0_sha1));
				}
            	firmware_update_control_block_image.data.lifecycle_state = LIFECYCLE_STATE_UPDATING;
    		    R_Sha1((uint8_t *)&firmware_update_control_block_image.data, hash_sha1, sizeof(firmware_update_control_block_image.data));
    		    memcpy(firmware_update_control_block_image.hash_sha1, hash_sha1, SHA1_HASH_LENGTH_BYTE_SIZE);
    		    required_dataflash_block_num = sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
    		    if(sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
    		    {
    		    	required_dataflash_block_num++;
    		    }
				R_FLASH_Erase((flash_block_address_t)FLASH_DF_BLOCK_0, required_dataflash_block_num);
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_ERASE_DATA_FLASH;
		    }
		    else
		    {
			    load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
		    }
		    break;
		case FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_ERASE_DATA_FLASH:
			/* this state will be changed by callback routine */
			break;
		case FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_WRITE_DATA_FLASH:
			/* this state will be changed by callback routine */
			break;
		case FIRMWARE_UPDATE_STATE_FINALIZE_COMPLETED:
			load_firmware_control_block.progress = 100;
		    load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_COMPLETED;
		    break;
		case FIRMWARE_UPDATE_STATE_COMPLETED:
			break;
		case FIRMWARE_UPDATE_STATE_ERROR:
			load_firmware_control_block.progress = 100;
			break;
		default:
			break;
	}
	return load_firmware_control_block.progress;
}

void flash_load_firmware_callback_function(void *event)
{
	uint32_t event_code;
	event_code = *((uint32_t*)event);

	switch(event_code)
	{
		case FLASH_INT_EVENT_ERASE_COMPLETE:
#if (MY_BSP_CFG_OTA_ENABLE == 1) || (MY_BSP_CFG_OTA_ENABLE == 3)
			if(FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE == load_firmware_control_block.status)
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_READ_WAIT_COMPLETE;
			}
			else if(FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_ERASE_DATA_FLASH == load_firmware_control_block.status)
			{
				R_FLASH_Write((uint32_t)&firmware_update_control_block_image, FLASH_DF_BLOCK_0, sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK));
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_WRITE_DATA_FLASH;
			}
			else
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
			}
#elif (MY_BSP_CFG_OTA_ENABLE == 2)
			if(FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE == load_firmware_control_block.status)
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERASE_COMPLETE;
			}
			else
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
			}
#endif
			break;
		case FLASH_INT_EVENT_WRITE_COMPLETE:
#if (MY_BSP_CFG_OTA_ENABLE == 1) || (MY_BSP_CFG_OTA_ENABLE == 3)
			if(FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE == load_firmware_control_block.status)
			{
				load_firmware_control_block.offset += FLASH_BUCKET_SIZE;
		    	load_firmware_control_block.progress = (uint32_t)(((float)(load_firmware_control_block.offset)/(float)((FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))*100));

		    	if( load_firmware_control_block.firmware_length == load_firmware_control_block.offset )
				{
					load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE;
				}
				else
				{
					load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_READ_WAIT_COMPLETE;
				}
			}
			else if(FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_WRITE_DATA_FLASH == load_firmware_control_block.status)
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE_COMPLETED;
			}
			else
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
			}
#elif (MY_BSP_CFG_OTA_ENABLE == 2)
			if(FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE == load_firmware_control_block.status)
			{
                load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_WRITE_COMPLETE;
			}
			else
			{
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
			}
#endif
			break;
		case FLASH_INT_EVENT_TOGGLE_BANK:
	        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
	        SYSTEM.SWRR = 0xa501;
			while(1);	/* software reset */
			break;
		default:
			nop();
			break;
	}
}


/******************************************************************************
Function Name   : file_write_sub
Description     : This function writes the file corresponding to the ID value
                  passed as an argument and advances the file pointer by the
                  amount write. The file pointer is recorded in the file
                  management information for each ID value and is maintained
                  until the file close function is called.
Arguments       : file_id -
                      ID value of the file to write
                  buf -
                      Storage area for the file data write
                  write_size -
                      Size of the file to write
Return Value    : (-1) -
                      Error
                  (0) -
                      Normal completion
******************************************************************************/
int16_t file_write_process(uint8_t *buf, int16_t write_size, uint32_t Offset)
{
    uint16_t 	file_size = 0;
    uint8_t     drvno = 0;
	FRESULT 	ret = TFAT_FR_OK;

    R_USB_HmscGetSem();
   	ret = R_tfat_f_lseek(&file, Offset);
    if (TFAT_FR_OK == ret)
    {
    	ret = R_tfat_f_write(&file, buf, (uint16_t)write_size, &file_size);
    	if (TFAT_FR_OK == ret)
    	{
            g_isFileWrite = USB_APL_YES;
        }
        else
        {
			g_isFileWrite = USB_APL_NO;
		}
		if ((uint16_t)write_size != file_size)
		{
			g_isFileWrite = USB_APL_NO;
		}
	}
	else
	{
        g_isFileWrite = USB_APL_NO;
    }
    R_USB_HmscRelSem();

