renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type2/aws_ota_pal.c
    if (USB_APL_NO == g_isFileWrite)
    {
        return -1;
    }

    return 0;
}

#if (MY_BSP_CFG_OTA_ENABLE == 2)
/******************************************************************************
Function Name   : on_the_fly_write_process
Description     : 
Arguments       : 
Return Value    : 
******************************************************************************/
int16_t on_the_fly_write_process(uint8_t *buf, int16_t write_size, uint32_t Offset)
{
    uint32_t top_pointer = 0;
    uint32_t return_code_pointer = 0;
    uint32_t buffer_pointer = 0;
    uint32_t flash_address = 0;
    uint32_t block_size = 0;
    uint32_t index = 0; // 最初に書き込むコードフラッシュアドレスを決める

    uint8_t buf_tmp[BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH];
    uint8_t buf_code_flash[CODE_FLASH_WRITE_BUFFER_SIZE] = {0};
    uint8_t* p_data = buf;

    xSemaphoreTake(OTASemaphoreHandle, portMAX_DELAY);

    while (write_size > block_size)
    {
        memset(buf_tmp, 0, sizeof(buf_tmp));

        // 1)bufの先頭から改行コードがくるまでポインタを進める。
        top_pointer = (uint32_t)p_data;
        return_code_pointer = (uint32_t)(strstr((char*)p_data, "\r\n"));
        buffer_pointer = return_code_pointer - top_pointer;

        // ①ポインタが"=="または"="の場合
        if (BASE64_ENCODE_EQUAL_CHARACTER_LENGTH >= buffer_pointer)
        {
            /* Do nothing */
        }
        // ②ポインタが"upprogram fff00000"の場合
        else if (BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH < buffer_pointer)
        {
            memcpy(buf_tmp, (p_data + buffer_pointer - BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH), BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH);
        }
        // ③ポインタが"LS0tLS1CRUdJTiBDRVJUSQ==\r\n"の場合
        else
        {
            uint32_t diff = 0;
            diff = BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH - buffer_pointer;
            if (0 != diff)
            {
                memset(buf_tmp, '/', diff);
                memcpy(&buf_tmp[diff], p_data, buffer_pointer);
            }
            else
            {
                memcpy(buf_tmp, p_data, buffer_pointer);
            }
        }

        // 2)ポインタから1行分 sscanf() でパースする。・・・2行目のパース
        //   最初に出てくるコードフラッシュのアドレス(2行目)情報を取得する
        uint8_t arg1[64] = {0};
        uint8_t arg2[64] = {0};
        uint8_t arg3[64] = {0};

        // 3)コードフラッシュ書込み用の512バイトRAM を用意する
        memset(buf_code_flash, 0xff, sizeof(buf_code_flash));

        sscanf((char*)(p_data + buffer_pointer + 1), "%64s %64s %64s", (char*)arg1, (char*)arg2, (char*)arg3);
        if (!strcmp((char *)arg1, "upprogram"))
        {
            sscanf((char*)arg2, "%x", &flash_address);

            // 4)arg2のアドレスから、1)でバッファリングできたデータバイト数を引いたアドレスに、
            //   対応するコードフラッシュ書込み用の512バイトRAMに1) でバッファリングできたデータを
            //   base64デコードしてコピー

            // 後方が"=="または"="以外、または、1行目がsha1ではない場合
            if ((BASE64_ENCODE_EQUAL_CHARACTER_LENGTH < buffer_pointer) || ((uint32_t)BOOT_LOADER_MIRROR_FIRST_ADDRESS != flash_address))
            {
                flash_address -= BASE64_DECODE_TOTAL_LENGTH; // 1行前のコードフラッシュアドレスが書き込みたい先頭アドレス
            }
            
            // RAMのデータ格納位置を決める＆コードフラッシュ書き込み単位のアライメントを取る
            if (flash_address & (CODE_FLASH_WRITE_SIZE - 1))
            {
                // RAMのデータ格納位置を決める(16バイト単位)
                index = flash_address & CODE_FLASH_16BYTE_MASK;
                // コードフラッシュ書き込み単位(128バイト)のアライメントを取る
                flash_address &= CODE_FLASH_128BYTE_ALIGN;
            }
            else
            {
                // RAMのデータ格納位置は先頭
                index = 0;
                // アライメントが取れているので調整不要
            }

            // 後方が"=="または"="以外の場合、512バイトRAMに1)でバッファリングしたデータをbase64でコピー
            if (BASE64_ENCODE_EQUAL_CHARACTER_LENGTH < buffer_pointer)
            {
                base64_decode(buf_tmp, &buf_code_flash[index], BASE64_ENCODE_ONE_LINE_CHARACTER_LENGTH);
                index += BASE64_DECODE_TOTAL_LENGTH;
            }
        }
        else
        {
            // RAMのデータ格納位置は先頭
            index = 0;
        }

        // 5) arg3をbase64デコードしてコードフラッシュ書込み用の512バイトRAMに入れる。
        do
        {
            memset(arg1, 0, sizeof(arg1));
            memset(arg2, 0, sizeof(arg2));
            memset(arg3, 0, sizeof(arg3));

            sscanf((char*)(p_data + buffer_pointer + 1), "%64s %64s %64s", (char*)arg1, (char*)arg2, (char*)arg3);
            if (!strcmp((char *)arg1, "upprogram"))
            {
                if (0 == flash_address) // 初めてコードアドレスデータが出現した場合
                {
                    sscanf((char*)arg2, "%x", &flash_address);
                }
                base64_decode(arg3, &buf_code_flash[index], strlen((char *)arg3));
                buffer_pointer += BASE64_ENCODE_CF_TOTAL_LENGTH;
                index += BASE64_DECODE_TOTAL_LENGTH;
            }
            else if (!strcmp((char *)arg1, "upconst"))
            {
                buffer_pointer += BASE64_ENCODE_DF_TOTAL_LENGTH;
            }
            else if (!strcmp((char *)arg1, "sha1"))
            {
                buffer_pointer += BASE64_ENCODE_SHA1_TOTAL_LENGTH;
            }
            else
            {
                buffer_pointer = write_size;
            }
        }
        while ((index < CODE_FLASH_WRITE_SIZE) && (buffer_pointer < write_size));

        // 6) 1)-5)を繰り返し、arg2 + 16 が 128の倍数になってたら、コードフラッシュ書込み用の128バイトRAMをコードフラッシュに書き込む。
        //    このとき、対象のコードフラッシュを128バイト分を一度新しいRAMに読み出し、
        //    コードフラッシュ書込み用の128バイトRAMをそこに転写（ANDを取る）。
        if (0 != index)
        {
            uint8_t cnt = 0;
            uint8_t* p_flash = (uint8_t *)flash_address;
            for (cnt = 0; cnt < CODE_FLASH_WRITE_SIZE; cnt++, p_flash++)
            {
                buf_code_flash[cnt] &= *p_flash;
            }

            // 128バイトのコードフラッシュを消去する
            load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE;
            R_FLASH_Erase((flash_block_address_t)(BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + (flash_address - BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS)),
                          CODE_FLASH_WRITE_SIZE);
            while (FIRMWARE_UPDATE_STATE_ERASE_COMPLETE != load_firmware_control_block.status)
            {
                load_firmware_process();
                vTaskDelay(5);
            }
            
            // 転写後のRAM128バイトをコードフラッシュに書き込む。
            load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE;
            R_FLASH_Write((uint32_t)buf_code_flash,
                          (uint32_t)(BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS + (flash_address - BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS)),
                          sizeof(buf_code_flash));
            while (FIRMWARE_UPDATE_STATE_WRITE_COMPLETE != load_firmware_control_block.status)
            {
                load_firmware_process();
                vTaskDelay(5);
            }
        }
        
        // 全データチェック済の場合ループを抜ける
        if (buffer_pointer >= write_size)
        {
            break;
        }

        // 128バイト書き込み完了。残データの書き込みが完了するまで繰り返し。
        p_data += (buffer_pointer + BASE64_ENCODE_RETURN_CODE_LENGTH);
        block_size += CODE_FLASH_WRITE_SIZE;
    }

