renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type2/aws_ota_pal.c
    xSemaphoreGive(OTASemaphoreHandle);

    return 0;
}
#endif /* MY_BSP_CFG_OTA_ENABLE == 2 */

#if (MY_BSP_CFG_OTA_ENABLE == 3)
/***********************************************************************************************************************
* Function Name: serial_flash_firm_block_read
* Description  :
* Arguments    :
* Return Value :
***********************************************************************************************************************/
static int32_t serial_flash_firm_block_read(uint32_t *firmware, uint32_t offset)
{
    uint8_t buf[256] = {0};
    uint8_t arg1[256] = {0};
    uint8_t arg2[256] = {0};
    uint8_t arg3[256] = {0};
    uint32_t read_size = 0;
    static uint32_t upprogram[4 + 1] = {0};
    static uint32_t current_char_position = 0;
    static uint32_t current_file_position = 0;
    static uint32_t previous_file_position = 0;

    flash_spi_info_t Flash_Info_R;
    flash_spi_status_t Ret = FLASH_SPI_SUCCESS;

    if (0 == offset)
    {
        current_char_position = 0;
        current_file_position = 0;
        previous_file_position = 0;
        memset(upprogram,0,sizeof(upprogram));
    }

    xSemaphoreTake(OTASemaphoreHandle, portMAX_DELAY);

	current_char_position = 0;
	memset(buf, 0, sizeof(buf));

	while(1)
	{
        memset(buf, 0, sizeof(buf));
	    Flash_Info_R.addr   = previous_file_position;
	    Flash_Info_R.cnt    = FREAD_SIZE;
//	    Flash_Info_R.p_data = &buf[current_char_position++];
	    Flash_Info_R.p_data = &buf[current_char_position];
	    Flash_Info_R.op_mode = FLASH_SPI_SINGLE;
        Ret = R_FLASH_SPI_Read_Data(0, &Flash_Info_R);
        if (FLASH_SPI_SUCCESS == Ret)
		{
			previous_file_position += FREAD_SIZE;

			/* received 1 line */
			if(strstr((char*)buf, "\r\n"))
			{
				memset(arg1, 0, sizeof(arg1));
				memset(arg2, 0, sizeof(arg2));
				memset(arg3, 0, sizeof(arg3));
				
				sscanf((char*)buf, "%256s %256s %256s", (char*)arg1, (char*)arg2, (char*)arg3);

				if (!strcmp((char *)arg1, "sha1"))
				{
#if (FREAD_SIZE == 45U)
					previous_file_position -= (CF_DATA_LINE_NUM - PARAM_DATA_LINE_NUM);
//				        	ret = R_tfat_f_lseek(&file, previous_file_position);
					for(int i=PARAM_DATA_LINE_NUM; i < CF_DATA_LINE_NUM; i++)
					{
						arg2[i] = NULL;
					}
#endif
					base64_decode(arg2, (uint8_t *)load_firmware_control_block.hash_sha1, strlen((char *)arg2));
				}
				if (!strcmp((char *)arg1, "max_cnt"))
				{
					sscanf((char*) arg2, "%x", load_firmware_control_block.firmware_length);
				}
				if (!strcmp((char *)arg1, "upprogram"))
				{
            		base64_decode(arg3, (uint8_t *)upprogram, strlen((char *)arg3));
            		memcpy(&firmware[current_file_position], upprogram, 16);
                	current_file_position += 4;
                	read_size += 16;
				}
#if (FREAD_SIZE == 45U)
				if (!strcmp((char *)arg1, "upconst"))
				{
					// DATA FLASH data
					previous_file_position -= (CF_DATA_LINE_NUM - DF_DATA_LINE_NUM);
//				        	ret = R_tfat_f_lseek(&file, previous_file_position);
				}
#endif
//				if((current_file_position * 4) == FLASH_BUCKET_SIZE)
				if((current_file_position * 4) >= FLASH_BUCKET_SIZE)
				{
					current_file_position = 0;
					break;
				}
				current_char_position = 0;
				memset(buf, 0, sizeof(buf));
			}
		}
		else
		{
			goto serial_flash_firm_block_read_error;
			break;
		}
	}

    xSemaphoreGive(OTASemaphoreHandle);
	if (FLASH_SPI_SUCCESS != Ret)
	{
serial_flash_firm_block_read_error:
		return -1;
	}

    return 0;
}

/******************************************************************************
Function Name   : on_the_fly_write_process
Description     : 
Arguments       : 
Return Value    : 
******************************************************************************/
int16_t serial_flash_write_process(uint8_t *buf, int16_t write_size, uint32_t Offset)
{
    flash_spi_info_t Flash_Info_W;
    flash_spi_status_t Ret = FLASH_SPI_SUCCESS;

    xSemaphoreTake(OTASemaphoreHandle, portMAX_DELAY);

    uint32_t internal_cnt = 0;

    do
    {
        Flash_Info_W.addr    = Offset + internal_cnt;
        Flash_Info_W.cnt     = SERIAL_FLASH_FIT_COUNT;
        Flash_Info_W.p_data  = (uint8_t *)&buf[internal_cnt];
        Flash_Info_W.op_mode = FLASH_SPI_SINGLE;
        Ret = R_FLASH_SPI_Write_Data_Page(0, &Flash_Info_W);
        if (FLASH_SPI_SUCCESS > Ret)
        {
            return -1;
        }
        while (FLASH_SPI_SUCCESS_BUSY == R_FLASH_SPI_Polling(0, FLASH_SPI_MODE_PROG_POLL))
        {
            vTaskDelay(5);
        }
        internal_cnt += SERIAL_FLASH_FIT_COUNT;
    }
    while (internal_cnt < write_size);

    xSemaphoreGive(OTASemaphoreHandle);

    return 0;
}
#endif /* MY_BSP_CFG_OTA_ENABLE == 3 */

#pragma section FRAM2
#pragma interrupt (dummy_int)
static void dummy_int(void)
{
	/* nothing to do */
}


/* end of file */
